a = [5, 4, 80, 4, 0, 1, 0, 9, 5, 4]  # в файле хранятся числа от 0 до 100
# Три подряд идущих элементов, сумма которых максимальна и четна
b = c = d = -1
for i in range(len(a) - 2):
    if a[i] + a[i+1] + a[i+2] > b + c + d and (a[i] + a[i+1] + a[i+2]) % 2 == 0:
        b = a[i]
        c = a[i+1]
        d = a[i+2]
print(b, c, d)

# 2 способ
a = [5, 4, 80, 4, 0, 1, 0, 9, 5, 4]  # в файле неизвестно какие числа
# Три подряд идущих элементов, сумма которых максимальна и четна
b = c = d = 0
flag = True
for i in range(len(a) - 2):
    if (a[i] + a[i+1] + a[i+2] > b + c + d and (a[i] + a[i+1] + a[i+2]) % 2 == 0) or ((a[i] + a[i+1] + a[i+2]) % 2 == 0) and flag:
        b = a[i]
        c = a[i+1]
        d = a[i+2]
        flag = False

print(b, c, d)